#!/bin/bash  
# ============================================================
# symbols.sh - JOE_style_def - Symbol Collection
# ============================================================

symbols_() { 
    # รวมสัญลักษณ์และจัดกลุ่มละ 10 ตัว เว้นวรรค 2 spaces
    local type=""
    
    # กลุ่มเส้นตรงและวงเล็บ (Brackets & Lines)
    type+=\n"∥  ‖  ⟬  ⟭  ⟦  ⟧  |  ¦  ‖  !"\n

    type+="‼  İ  ɭ  l  Ţ  ⌈  ⌉  ⌊  ⌋  —"\n

    
    # กลุ่มลูกศร (Arrows)
    type+=\n"↿  ↾  ⇣  ⇡  ⇩  ⇧  ⇦  ⇨  ⇫  ⇮"\n

    type+="⇬  ⇯  ↖  ↗  ↙  ↘  ←  →  ↑  ↓"\n

    
    # กลุ่มสี่เหลี่ยมและรูปทรงเหลี่ยม (Squares & Polygons)
    type+=\n"▢  ▥  ▨  ▬  ▭  ▣  ▦  ▩  ▮  ▯"\

    type+="▤  ▧  ◊  ▪  ▫  ▴  ▵  ◂  ▸  ◃"\n

    type+="▹  ◆  ◇  ◈  ▱  ▰  ∎"\n

     ◊▬▭▬◊ 
    # กลุ่มวงกลมและจุด (Circles & Dots)
    type+=\n"◌  ●  ◙  ▼  ▽  ○  ◓  ◍  ◚  ◪"\n

    type+="•  ⁕  ‣  ⁴  ∏  ∐"\n
    


    printf '%b\n' "$type"
}
new_symbol() {
   local='──────────────
━━━━━━━━━━━━━━

┄┄┄┄┄┄┄┄┄┄┄┄
┈┈┈┈┈┈┈┈┈┈┈┈

══════════════
┌──────────┐
│          │
└──────────┘

╭──────────╮
│          │
╰──────────╯

╔══════════╗
║          ║
╚══════════╝
░░░░░░░░
▒▒▒▒▒▒▒▒
▓▓▓▓▓▓▓▓
████████
← ↑ → ↓

◀ ▲ ▶ ▼

➜ ➝ ➞ ➤

⇒ ⇨ ⇢● ○ ◉ ◎

◍ ◌

⬤ ◯

🟢 🟡 🔴
◢ ◣ ◤ ◥

▲ ▼ ▶ ◀

△ ▽ ▷ ◁
 ▏ ▎ ▍ ▌ ▋ ▊ ▉ █

█ ▉ ▊ ▋ ▌ ▍ ▎ ▏'  ▋▌▌

echo '──────────────
━━━━━━━━━━━━━━

┄┄┄┄┄┄┄┄┄┄┄┄
┈┈┈┈┈┈┈┈┈┈┈┈

══════════════
┌──────────┐
│          │
└──────────┘

╭──────────╮
│          │
╰──────────╯

╔══════════╗
║          ║
╚══════════╝
░░░░░░░░
▒▒▒▒▒▒▒▒
▓▓▓▓▓▓▓▓
████████
← ↑ → ↓

◀ ▲ ▶ ▼

➜ ➝ ➞ ➤

⇒ ⇨ ⇢● ○ ◉ ◎

◍ ◌

⬤ ◯

🟢 🟡 🔴
◢ ◣ ◤ ◥

▲ ▼ ▶ ◀

△ ▽ ▷ ◁
▏▎▍▌▋▊▉█

█▉▊▋▌▍▎▏'
}


 for f in "/mnt/c/Users/User/Documents/mumusharedfolder/VideoRecords"/*.mp4; do
 
    echo "Processing file: $f"
    # Add your processing commands here
    mv "$f" "/mnt/h/boom/${f##*/}"
 done
